In [2]:
%matplotlib inline
import pandas as pd

In [3]:
from IPython.core.display import HTML
css = open('style-table.css').read() + open('style-notebook.css').read()
HTML('<style>{}</style>'.format(css))

In [4]:
titles = pd.read_csv('data/titles.csv')
titles.head()

                              title  year
0                            Kaakan  2015
1      Die Welt in Flammen. 2. Teil  1923
2                The Three Passions  1928
3                       I Love Desi  2015
4  Tales of Mystery and Imagination  2009

In [5]:
cast = pd.read_csv('data/cast.csv')
cast.head()

                  title  year      name   type                character     n
0        Closet Monster  2015  Buffy #1  actor                  Buffy 4  31.0
1       Suuri illusioni  1985    Homo $  actor                   Guests  22.0
2   Battle of the Sexes  2017   $hutter  actor          Bobby Riggs Fan  10.0
3  Secret in Their Eyes  2015   $hutter  actor          2002 Dodger Fan   NaN
4            Steve Jobs  2015   $hutter  actor  1988 Opera House Patron   NaN

### How many movies are listed in the titles dataframe?

In [14]:
len(titles)

226013

### What are the earliest two films listed in the titles dataframe?

In [16]:
titles.sort_values('year').head(2)

                    title  year
38200          Miss Jerry  1894
753    The Startled Lover  1898

### How many movies have the single-word title "Hamlet"?

In [21]:
t = titles
len(t[t.title == 'Hamlet'])

20

### How many movies are titled "North by Northwest"?

In [23]:
len(t[t.title == 'North by Northwest'])

1

### When was the first movie titled "Hamlet" made?

In [27]:
t = titles
(t[t.title == 'Hamlet']).sort_values('year').head(1)

         title  year
208932  Hamlet  1910

### List all of the "Treasure Island" movies from earliest to most recent.

In [29]:
t = titles
(t[t.title == 'Treasure Island']).sort_values('year')

                  title  year
85384   Treasure Island  1918
67136   Treasure Island  1920
61562   Treasure Island  1934
160769  Treasure Island  1950
38717   Treasure Island  1972
154371  Treasure Island  1973
89339   Treasure Island  1985
22702   Treasure Island  1999

### How many movies were made in the year 1950?

In [34]:
t = titles
len(t[t.year == 1950])

1109

### How many movies were made in the year 1960?

In [35]:
t = titles
len(t[t.year == 1960])

1496

### How many movies were made from 1950 through 1959?

In [43]:
t = titles
len(t[(t.year >= 1950) & (t.year <= 1959)])

12664

### In what years has a movie titled "Batman" been released?

In [47]:
(t[t.title == 'Batman'])

         title  year
110926  Batman  1943
198996  Batman  1989

### How many roles were there in the movie "Inception"?

In [57]:
c = cast
len(c[c.title == 'Inception'])

78

### How many roles in the movie "Inception" are NOT ranked by an "n" value?

In [86]:
c = cast
(c[c.title == 'Inception']).n.isnull().sum()

np.int64(27)

### But how many roles in the movie "Inception" did receive an "n" value?

In [87]:
c = cast
(c[c.title == 'Inception']).n.count()

np.int64(51)

In [102]:
cast

,title,year,name,type,character,n
0,Closet Monster,2015,Buffy #1,actor,Buffy 4,31.0
1,Suuri illusioni,1985,Homo $,actor,Guests,22.0
2,Battle of the Sexes,2017,$hutter,actor,Bobby Riggs Fan,10.0
3,Secret in Their Eyes,2015,$hutter,actor,2002 Dodger Fan,NaN
4,Steve Jobs,2015,$hutter,actor,1988 Opera House Patron,NaN
...,...,...,...,...,...,...
3442897,Foxtrot,1988,Lilja Þórisdóttir,actress,Dóra,24.0
3442898,Niceland (Population. 1.000.002),2004,Sigríður Jóna Þórisdóttir,actress,Woman in Bus,26.0
3442899,Skammdegi,1985,Dalla Þórðardóttir,actress,Hjúkrunarkona,9.0
3442900,U.S.S.S.S...,2003,Kristín Andrea Þórðardóttir,actress,Afgr.dama á bensínstöð,17.0
3442901,Bye Bye Blue Bird,1999,Rosa á Rógvu,actress,Pensionatværtinde,NaN

### Display the cast of "North by Northwest" in their correct "n"-value order, ignoring roles that did not earn a numeric "n" value.

In [129]:
c = cast
c = ((c[(c.title == 'North by Northwest') & (c.n.notnull())])).sort_values('n')
c

,title,year,name,type,character,n
797150,North by Northwest,1959,Cary Grant,actor,Roger O. Thornhill,1.0
3201980,North by Northwest,1959,Eva Marie Saint,actress,Eve Kendall,2.0
1333732,North by Northwest,1959,James Mason,actor,Phillip Vandamm,3.0
2878461,North by Northwest,1959,Jessie Royce Landis,actress,Clara Thornhill,4.0
326415,North by Northwest,1959,Leo G. Carroll,actor,The Professor,5.0
2780220,North by Northwest,1959,Josephine Hutchinson,actress,Mrs. Townsend,6.0
1551491,North by Northwest,1959,Philip Ober,actor,Lester Townsend,7.0
1167105,North by Northwest,1959,Martin Landau,actor,Leonard,8.0
2239203,North by Northwest,1959,Adam Williams,actor,Valerian,9.0
1657968,North by Northwest,1959,Edward Platt,actor,Victor Larrabee,10.0
609229,North by Northwest,1959,Robert Ellenstein,actor,Licht,11.0
2100440,North by Northwest,1959,Les Tremayne,actor,Auctioneer,12.0
425645,North by Northwest,1959,Philip Coolidge,actor,Dr. Cross,13.0
1379980,North by Northwest,1959,Patrick McVey,actor,Sergeant Flamm,14.0
189719,North by Northwest,1959,Edward Binns,actor,Captain Junket,15.0
1267109,North by Northwest,1959,Ken Lynch,actor,Charley - Chicago Policeman,16.0

### Display the entire cast, in "n"-order, of the 1972 film "Sleuth".

In [133]:
c = cast
(c[(c.title == 'Sleuth') & (c.year == 1972)]).sort_values('n')

,title,year,name,type,character,n
1560814,Sleuth,1972,Laurence Olivier,actor,Andrew Wyke,1.0
299291,Sleuth,1972,Michael Caine,actor,Milo Tindle,2.0
342151,Sleuth,1972,Alec Cawthorne,actor,Inspector Doppler,3.0
1341313,Sleuth,1972,John (II) Matthews,actor,Detective Sergeant Tarrant,4.0
2490141,Sleuth,1972,Eve (III) Channing,actress,Marguerite Wyke,5.0
1325945,Sleuth,1972,Teddy Martin,actor,Police Constable Higgs,6.0

### Now display the entire cast, in "n"-order, of the 2007 version of "Sleuth".

In [134]:
c = cast
(c[(c.title == 'Sleuth') & (c.year == 2007)]).sort_values('n')

          title  year                 name     type          character    n
299292   Sleuth  2007        Michael Caine    actor             Andrew  1.0
1183659  Sleuth  2007             Jude Law    actor               Milo  2.0
1652936  Sleuth  2007        Harold Pinter    actor        Man on T.V.  3.0
238747   Sleuth  2007      Kenneth Branagh    actor  Other Man on T.V.  NaN
342152   Sleuth  2007  Alec (II) Cawthorne    actor  Inspector Doppler  NaN
2490140  Sleuth  2007    Eve (II) Channing  actress    Marguerite Wyke  NaN
3069393  Sleuth  2007    Carmel O'Sullivan  actress             Maggie  NaN

### How many roles were credited in the silent 1921 version of Hamlet?

In [139]:
c = cast
len((c[(c.title == 'Hamlet') & (c.year == 1921)]))

9

### How many roles were credited in Branagh’s 1996 Hamlet?

In [145]:
c = cast
((c[(c.title == 'Hamlet') & (c.year == 1996) ]))

,title,year,name,type,character,n
1547,Hamlet,1996,Riz Abbasi,actor,Attendant to Claudius,1.0
88092,Hamlet,1996,Richard Attenborough,actor,English Ambassador,2.0
145683,Hamlet,1996,Simon Russell Beale,actor,Second Gravedigger,37.0
196937,Hamlet,1996,David (V) Blair,actor,Attendant to Claudius,3.0
201517,Hamlet,1996,Brian Blessed,actor,Ghost of Hamlet's Father,4.0
230146,Hamlet,1996,Christopher Bowles,actor,Cadet in Play,NaN
238732,Hamlet,1996,Kenneth Branagh,actor,Hamlet,5.0
250230,Hamlet,1996,Richard Briers,actor,Polonius,6.0
270007,Hamlet,1996,Michael Bryant,actor,Priest,7.0
292609,Hamlet,1996,Peter Bygott,actor,Attendant to Claudius,8.0
315183,Hamlet,1996,Kenneth W Caravan,actor,Laertes Mob,NaN
458407,Hamlet,1996,Billy Crystal,actor,First Gravedigger,10.0
474456,Hamlet,1996,Charles Daish,actor,Stage Manager,11.0
527361,Hamlet,1996,Gérard Depardieu,actor,Reynaldo,13.0
548010,Hamlet,1996,Reece Dinsdale,actor,Guildenstern,14.0
553205,Hamlet,1996,Ken Dodd,actor,Yorick,15.0
601015,Hamlet,1996,Rob Edwards,actor,Lucianus,17.0
612462,Hamlet,1996,Jimmy Ellis,actor,Old Fortinbras,NaN
644433,Hamlet,1996,Nicholas Farrell,actor,Horatio,18.0
648298,Hamlet,1996,Ray Fearon,actor,Francisco,19.0
756674,Hamlet,1996,John Gielgud,actor,Priam,21.0
905902,Hamlet,1996,Charlton Heston,actor,Player King,23.0
982526,Hamlet,1996,Ravil Isyanov,actor,Cornelius,24.0
989355,Hamlet,1996,Derek Jacobi,actor,Claudius,25.0
1107240,Hamlet,1996,Jeffery Kissoon,actor,Fortinbras's Captain,27.0
1204627,Hamlet,1996,Jack Lemmon,actor,Marcellus,29.0
1281846,Hamlet,1996,Anthony Maddalena,actor,Elsinore Courtier,NaN
1297265,Hamlet,1996,Michael Maloney,actor,Laertes,31.0
1362729,Hamlet,1996,Ian McElhinney,actor,Barnardo,30.0
1417307,Hamlet,1996,John Mills,actor,Old Norway,33.0
1423703,Hamlet,1996,Jimi Mistry,actor,Sailor Two,34.0
1453364,Hamlet,1996,Frank (II) Morgan,actor,Pyrrhus,NaN
1866916,Hamlet,1996,Andrew Schofield,actor,Young Lord,38.0
1878415,Hamlet,1996,Orlando Seale,actor,Boatman,NaN
1892140,Hamlet,1996,Rufus Sewell,actor,Fortinbras,39.0
1968858,Hamlet,1996,Timothy Spall,actor,Rosencrantz,40.0
1971932,Hamlet,1996,John Spencer-Churchill,actor,Fortinbras's Captain,32.0
2033003,Hamlet,1996,Thomas Szekeres,actor,Young Hamlet,41.0
2067693,Hamlet,1996,Ben Thom,actor,First Player,42.0
2200283,Hamlet,1996,Don Warrington,actor,Voltimand,43.0
2244723,Hamlet,1996,Robin Williams,actor,Osric,45.0
2287546,Hamlet,1996,David Yip,actor,Sailor One,47.0
2295096,Hamlet,1996,Jimmy Yuill,actor,Alexander,NaN
2502297,Hamlet,1996,Julie Christie,actress,Gertrude,9.0
2570307,Hamlet,1996,Judi Dench,actress,Hecuba,12.0
2589800,Hamlet,1996,Angela Douglas,actress,Attendant to Gertrude,16.0
2683383,Hamlet,1996,Yvonne Gidden,actress,Doctor,20.0
2736899,Hamlet,1996,Rosemary Harris,actress,Player Queen,22.0
2844532,Hamlet,1996,Rowena King,actress,Attendant to Gertrude,26.0
2875820,Hamlet,1996,Sarah Lam,actress,Attendant to Gertrude,28.0
3141817,Hamlet,1996,Sian Radinger,actress,Prologue,35.0
3146422,Hamlet,1996,Melanie Ramsay,actress,Prostitute,NaN
3391416,Hamlet,1996,Perdita Weeks,actress,Second Player,44.0
3411264,Hamlet,1996,Kate Winslet,actress,Ophelia,46.0

In [138]:
cast

,title,year,name,type,character,n
0,Closet Monster,2015,Buffy #1,actor,Buffy 4,31.0
1,Suuri illusioni,1985,Homo $,actor,Guests,22.0
2,Battle of the Sexes,2017,$hutter,actor,Bobby Riggs Fan,10.0
3,Secret in Their Eyes,2015,$hutter,actor,2002 Dodger Fan,NaN
4,Steve Jobs,2015,$hutter,actor,1988 Opera House Patron,NaN
...,...,...,...,...,...,...
3442897,Foxtrot,1988,Lilja Þórisdóttir,actress,Dóra,24.0
3442898,Niceland (Population. 1.000.002),2004,Sigríður Jóna Þórisdóttir,actress,Woman in Bus,26.0
3442899,Skammdegi,1985,Dalla Þórðardóttir,actress,Hjúkrunarkona,9.0
3442900,U.S.S.S.S...,2003,Kristín Andrea Þórðardóttir,actress,Afgr.dama á bensínstöð,17.0
3442901,Bye Bye Blue Bird,1999,Rosa á Rógvu,actress,Pensionatværtinde,NaN

### How many "Hamlet" roles have been listed in all film credits through history?

### How many people have played an "Ophelia"?

### How many people have played a role called "The Dude"?

### How many people have played a role called "The Stranger"?

### How many roles has Sidney Poitier played throughout his career?

### How many roles has Judi Dench played?

### List the supporting roles (having n=2) played by Cary Grant in the 1940s, in order by year.

### List the leading roles that Cary Grant played in the 1940s in order by year.

### How many roles were available for actors in the 1950s?

### How many roles were available for actresses in the 1950s?

### How many leading roles (n=1) were available from the beginning of film history through 1980?

### How many non-leading roles were available through from the beginning of film history through 1980?

### How many roles through 1980 were minor enough that they did not warrant a numeric "n" rank?